{
  "id": "riskmaster",
  "title": "Riskmaster",
  "img": "img/riskmaster-logo.png",
  "briefImg": "img/riskmaster-thumb.png",
  "role": "Design | Development",
  "responsibility": "I led design and development (objective-c).",
  "tagline": "A visual portfolio management tool.",
  "problem": "<b>It was difficult to filter, recall, and find important details for portfolio investments.</b><br><br>Tim Draper, of Draper Associates, has been investing in companies for a long time. Often, at events or in meetings, he would find himself struggling to remember key details about a company, but he could always remember some key filter. In these moments, he didn’t have his laptop to search through the database of his investments, and even if he did - it wouldn’t be much help. The antiquated system all the data was stored in made it difficult to quickly visualize and skim through companies based on things like company type, the fund invested through, or the founder’s name. He needed to have his investments in his pocket in an easy to browse interface.",
  "research": "I worked with Tim to find out how he would use the existing system and the key information he usually needed. In addition, I spoke to his assistant and key staff members who would also be using the application to find out their issues, and any requests they commonly received from Tim for information.",
  "constraints": "<b>Short timeline:</b> 1 month for complete cycle of ideation, design, and beta build.<br><b>Data and Formats:</b> The data I could display, and how it could be pulled from the database, had limited to no flexibility based on the services the customer used.",
  "design": "Ut fugit eius voluptatem ipsa porro. Et et dicta reprehenderit officiis. Non est natus. Quasi nihil non. Ut fugit eius voluptatem ipsa porro. Sit autem est fugit. Voluptates similique aperiam in ut nam minima fugiat.",
  "designImg1": "img/riskmaster-homegrid.png",
  "designImg2": "img/riskmaster-cardview.png",
  "designImg3": "img/riskmaster-detailview.png",
  "designImg4": "img/riskmaster-gridview.png",
  "retrospective": "Having social information for the founder and multi-tier filtering would provide an even better solution to the problem. These were left out in the original development cycle due to time/data constraints."
}
