{"id":"gigster","title":"Gigster","img":"img/gigster-logo.png","briefImg":"img/gigster.jpg","role":"Design | Development","responsibility":"I led design, prototyping, and front-end implementation for the user-facing dashboard and project page.","tagline":"On demand software development.","problem":"<b>It was difficult to visualize and find important information.</b> <br><br><b>Problem One - The Unhelpful Dashboard:</b><br>You’re a project manager for many projects, in multiple locations, working with teams in different time zones - and your main window into the state of all of them is a dashboard page on your screen. Sounds a little stressful, but you know your handy dashboard has your back until… wait, this dashboard doesn’t have your back at all! You stare, slack jawed staring at a listing of nothing but project names, paralyzed by the realization that you have to click into and scroll through each and every one to find out what’s happening. The part of your workflow that should only take 30 minutes actually eats into hours of your day.<br><br><b>Problem Two - The Cluttered Description Page:</b><br>You’re a developer trying to find the key links for the project you just started. You know they’re included somewhere in the project page, but for the life of you - you can’t remember where. After a lot of clicking, squinting, and scrolling around, you finally stumble upon them - but wait, where were those files…","research":"At this point, the platform was still fairly early stage and the individual most connected with users was the CTO. I worked with him to find out the largest problems up to this point and what the product needed to be able to do going forward. Since I was part of the network, I was also available to collect qualitative information and do user testing with project managers and developers on the platform.","researchImg1":"img/gigster-01.png","researchCaption1":"We knew we needed to visualize key project information, but had to test what the most pertinent information was.","researchImg2":"img/gigster-03.png","researchCaption2":"An alternative explored layout.","constraints":"<b>Short timeline:</b> < 1 month for complete cycle of ideation, design, and production implementation.<br><b>Layout:</b> Some aspects of the original layout needed to be maintained for engineering/timeline purposes.","design":"I created a visual interface using a progress bar for timeliness and an emoticon face for customer satisfaction. They have potential states of good (green), be careful (orange), and this is going south quickly (red) to notify users when action is necessary. We also modularized the gig details page, locking key info to the top for easy access.","designImg1":"img/gigster-dash.png","designCaption1":"I created a visual dashboard based on key information states.","designImg2":"img/gigster-project.png","designCaption2":"The modularized dashboard is easier to navigate and find key information regularly.","retrospective":"In retrospect (and going forward!), I’m aware of some weaknesses in the current design. As Gigster scales, the timeline for a project to be completely handed off/deactivated can be much longer than the actual end date. Because of this, an individual user’s dashboard can be filled with more projects than the max project estimate in the original designs - reducing the intended simplicity."}